InformationRegisters/упИерархияГеографическихЗон.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упИерархияГеографическихЗон</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Зона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упДоступныеГеографическиеЗоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упДоступныеГеографическиеЗоны</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПравилаДоступности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПравилаДоступностиГеографическихЗон</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГеографическаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/упПравилаДоступностиГеографическихЗон.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упПравилаДоступностиГеографическихЗон</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапрещенаРаботаВУказанныхЗонах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГеографическиеЗоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГеографическаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Constants/упКонтролироватьДоступностьГеографическихЗон/Ext/ValueManagerModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если Значение И Не Константы.упКонтролироватьДоступностьГеографическихЗон.Получить() Тогда 
		ЗаписатьПравилаДоступности();
	КонецЕсли;
	
КонецПроцедуры

// Процедура записывает информацию о правилах доступности
// 
// Параметры:
//  Нет.
//
Процедура ЗаписатьПравилаДоступности()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	упГеографическиеЗоны.Ссылка КАК Зона,
	|	упПравилаДоступностиГеографическихЗон.Ссылка КАК Правила,
	|	упПравилаДоступностиГеографическихЗон.ЗапрещенаРаботаВУказанныхЗонах
	|ПОМЕСТИТЬ втЗоныДляПерезаписи
	|ИЗ
	|	Справочник.упГеографическиеЗоны КАК упГеографическиеЗоны,
	|	Справочник.упПравилаДоступностиГеографическихЗон КАК упПравилаДоступностиГеографическихЗон
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Правила,
	|	Зона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	упПравилаДоступностиГеографическихЗонГеографическиеЗоны.Ссылка КАК Правила,
	|	упИерархияГеографическихЗон.Зона КАК Зона
	|ПОМЕСТИТЬ втЗоныПравил
	|ИЗ
	|	Справочник.упПравилаДоступностиГеографическихЗон.ГеографическиеЗоны КАК упПравилаДоступностиГеографическихЗонГеографическиеЗоны
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упИерархияГеографическихЗон КАК упИерархияГеографическихЗон
	|		ПО упПравилаДоступностиГеографическихЗонГеографическиеЗоны.ГеографическаяЗона = упИерархияГеографическихЗон.Родитель
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Правила,
	|	Зона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗоныДляПерезаписи.Правила,
	|	втЗоныДляПерезаписи.Зона КАК Зона
	|ИЗ
	|	втЗоныДляПерезаписи КАК втЗоныДляПерезаписи
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЗоныПравил КАК втЗоныПравил
	|		ПО втЗоныДляПерезаписи.Зона = втЗоныПравил.Зона
	|			И втЗоныДляПерезаписи.Правила = втЗоныПравил.Правила
	|ГДЕ
	|	(втЗоныДляПерезаписи.ЗапрещенаРаботаВУказанныхЗонах
	|				И втЗоныПравил.Зона ЕСТЬ NULL 
	|			ИЛИ НЕ втЗоныДляПерезаписи.ЗапрещенаРаботаВУказанныхЗонах
	|				И НЕ втЗоныПравил.Зона ЕСТЬ NULL )
	|ИТОГИ ПО
	|	Зона";
	
	ВыборкаЗоны = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЗоны.Следующий() Цикл 
		НаборЗаписей = РегистрыСведений.упДоступныеГеографическиеЗоны.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ГеографическаяЗона.Установить(ВыборкаЗоны.Зона);
		
		Выборка = ВыборкаЗоны.Выбрать();
		Пока Выборка.Следующий() Цикл 
			Запись = НаборЗаписей.Добавить();
			Запись.ПравилаДоступности = Выборка.Правила;
			Запись.ГеографическаяЗона = Выборка.Зона;
		КонецЦикла;
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;	
	
КонецПроцедуры // ЗаписатьПравилаДоступности()
